import './App.css';
import './generalPage.css';
import { Link } from "react-router-dom";

function GeneralPage() {
    let a = "агронОмія\n" +
        "алфАвІт\n" +
        "Аркушик\n" +
        "асиметрІя\n" +
        "багаторазОвий\n" +
        "безпринцИпний\n" +
        "бЕшкет\n" +
        "блАговіст\n" +
        "близькИй\n" +
        "болотИстий\n" +
        "борОдавка\n" +
        "босОніж\n" +
        "боЯзнь\n" +
        "бурштинОвий\n" +
        "бюлетЕнь\n" +
        "вАги (у множині)\n" +
        "вантажІвка\n" +
        "веснЯнИй\n" +
        "вИгода (користь)\n" +
        "вигОда (зручність)\n" +
        "видАння\n" +
        "визвОльний\n" +
        "вимОга\n" +
        "вИпадок\n" +
        "вирАзний\n" +
        "вИсіти\n" +
        "вИтрата\n" +
        "вишИваний\n" +
        "відвезтИ\n" +
        "відвестИ\n" +
        "вІдгомін\n" +
        "віднестИ\n" +
        "вІдомість (список)\n" +
        "відОмість (повідомлення, дані, популярність)\n" +
        "вІрші\n" +
        "віршовИй\n" +
        "вітчИм\n" +
        "гальмО, гАльма\n" +
        "глядАч\n" +
        "горошИна\n" +
        "граблІ\n" +
        "гуртОжиток\n" +
        "данИна\n" +
        "дАно\n" +
        "децимЕтр\n" +
        "дЕщиця\n" +
        "де-Юре\n" +
        "джерелО\n" +
        "дИвлячись\n" +
        "дичАвіти\n" +
        "діалОг\n" +
        "добовИй\n" +
        "добУток\n" +
        "довезтИ\n" +
        "довестИ\n" +
        "довІдник\n" +
        "дОгмат\n" +
        "донестИ\n" +
        "дОнька\n" +
        "дочкА\n" +
        "дрОва\n" +
        "експЕрт\n" +
        "єретИк\n" +
        "жалюзІ\n" +
        "завдАння\n" +
        "завезтИ\n" +
        "завестИ\n" +
        "зАвжди\n" +
        "завчасУ\n" +
        "зАгадка\n" +
        "заіржАвілий\n" +
        "заіржАвіти\n" +
        "закінчИти\n" +
        "зАкладка (у книзі)\n" +
        "зАкрутка\n" +
        "залишИти\n" +
        "замІжня\n" +
        "занестИ\n" +
        "зАпонка\n" +
        "заробІток\n" +
        "зАставка\n" +
        "зАстібка\n" +
        "застОпорити\n" +
        "звИсока\n" +
        "здАлека\n" +
        "зібрАння\n" +
        "зобразИти\n" +
        "зОзла\n" +
        "зрАння\n" +
        "зрУчний\n" +
        "зубОжіння\n" +
        "індУстрія";
    console.log(a.toLowerCase())

    return (
        <div className="mainBlock">
            <div className="choiceWindow">
                <div className="linkWraper">
                    <Link to="/Calendar" className="pageLink"><h1>Calendar</h1></Link>
                </div>
                <div className="linkWraper">
                    <Link to="/History" className="pageLink"><h1>History</h1></Link>
                </div>
            </div>
        </div>
    );
}

export default GeneralPage;
